01  WS-AREA. 
    05  WS-VAR PIC 9(5) VALUE 99999. 
    05  WS-FLAG PIC X VALUE 'N'.
    05 WS-OVERFLOW-FLAG PIC X VALUE 'N'.

PROCEDURE DIVISION.
    IF WS-VAR > 99999 THEN 
       MOVE 'Y' TO WS-OVERFLOW-FLAG 
    ELSE
       ADD 1 TO WS-VAR
    END-IF.
    DISPLAY WS-OVERFLOW-FLAG,
           WS-VAR
    .
    STOP RUN.